Revit 2027 API
BuiltInFailures.ElectricalFailures.ElementsBelongToOtherCircuit Property
 You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected cannot be added to this Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsBelongToOtherCircuit { get; }
Public Shared ReadOnly Property ElementsBelongToOtherCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsBelongToOtherCircuit {
	FailureDefinitionId^ get ();
}
static member ElementsBelongToOtherCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace